           02 KUNDE-ID          PIC X(10) VALUE SPACES.
           02 KONTO-ID          PIC X(10) VALUE SPACES.
           02 KONTO-TYPE        PIC X(10) VALUE SPACES.
           02 BALANCE           PIC ZZZZZZ9V99.
           02 VALUTA-KD         PIC X(10) VALUE SPACES.