       02  KUNDE-ID        PIC X(11).
       02  NAVN            PIC X(20).
       02  FOEDSELSDATO    PIC X(10).
       02  ADRESSE         PIC X(30).
       02  LAND            PIC X(2).
