       IDENTIFICATION DIVISION.
       PROGRAM-ID. Opgave10.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BANKFIL ASSIGN TO "Banker.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT TRANSAKTIONFIL ASSIGN TO "Transaktioner.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-FIL ASSIGN TO "Kontoudskrifter.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD BANKFIL.
       01 BANK-REKORD.
       COPY "BANKS.cpy".

       FD  TRANSAKTIONFIL.
       01 TRANSAKTIONER-REKORD.
       COPY "TRANSACTIONS.cpy".

       FD OUT-FIL.
       01 OUT-REKORD.
         02 OUTPUT-TEXT PIC X(150).

       WORKING-STORAGE SECTION.
       01 BANK-COUNT PIC 9(3) VALUE 0.
       01 EOF-TRANSAKTION PIC X VALUE "N".
       88 END-TRANSAKTION VALUE "Y".
       88 MORE-TRANSAKTION VALUE "N".
       01 EOF-BANK PIC X VALUE "N".
       88 END-BANK VALUE "Y".
       01 IX-KONTI PIC 9(3) VALUE 1.

       *> Array til Bank på 01 niveau
       01 BANK-ARRAY OCCURS 100 TIMES.
       COPY "BANKS.cpy".
       PROCEDURE DIVISION.
       MAIN-PROGRAM.

       *> Læs TRANSAKTIONFILen ind i array
  
       OPEN INPUT BANKFIL
           MOVE 1 TO BANK-COUNT
           MOVE "N" TO EOF-BANK
       PERFORM UNTIL END-BANK
               READ BANKFIL
           AT END
               SET END-BANK TO TRUE
           NOT AT END
               MOVE BANK-REKORD TO BANK-ARRAY(BANK-COUNT)
               ADD 1 TO BANK-COUNT
           END-READ
       END-PERFORM
           CLOSE BANKFIL
       
       OPEN INPUT TRANSAKTIONFIL
       OPEN OUTPUT OUT-FIL
       *> Læs TRANSAKTIONER og match med konti i array
       PERFORM UNTIL END-TRANSAKTION
           READ TRANSAKTIONFIL
           AT END
               SET END-TRANSAKTION TO TRUE
           NOT AT END
               PERFORM SKRIV-TRANSAKTION
               PERFORM MATCH-KONTI
           MOVE SPACES TO OUTPUT-TEXT
               WRITE OUT-REKORD
               END-READ
           END-PERFORM
           CLOSE TRANSAKTIONFIL
           CLOSE OUT-FIL
       STOP RUN.
       *> -------------------
       *> Formateringsparagraffer

       SKRIV-TRANSAKTION.
       MOVE SPACES TO OUTPUT-TEXT
           STRING "Kunde: " NAVN OF TRANSAKTIONER-REKORD
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
           STRING "Adresse: " ADRESSE OF TRANSAKTIONER-REKORD
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
 
       EXIT.
       MATCH-KONTI.
       PERFORM VARYING IX-KONTI FROM 1 BY 1 UNTIL IX-KONTI >=
       BANK-COUNT
       IF REG-NR OF BANK-ARRAY(IX-KONTI) = REG-NR OF 
       TRANSAKTIONER-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Registreringsnummer: " REG-NR OF BANK-ARRAY(IX-KONTI)
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Bank: " BANKNAVN OF BANK-ARRAY(IX-KONTI)
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Bankadresse: " BANKADRESSE OF BANK-ARRAY(IX-KONTI)
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Telefon: " TELEFON OF BANK-ARRAY(IX-KONTI)
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "E-mail: " EMAIL OF BANK-ARRAY(IX-KONTI)
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Kontoudskrift for kontonr.: " KONTO-ID OF
       TRANSAKTIONER-REKORD
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       MOVE SPACES TO OUTPUT-TEXT
       
       STRING "Dato: " TIDSPUNKT OF TRANSAKTIONER-REKORD
       " Transaktionstype: " TRANSAKTIONSTYPE OF TRANSAKTIONER-REKORD
       " Beløb: " BELOB OF TRANSAKTIONER-REKORD
       " " VALUTA OF TRANSAKTIONER-REKORD
       " Butik: " BUTIK OF TRANSAKTIONER-REKORD
           DELIMITED BY SIZE
           INTO OUTPUT-TEXT
       END-STRING
       WRITE OUT-REKORD
       END-IF
       END-PERFORM
       EXIT.
